# Biblioteca Pandas

É uma biblioteca open-source criada para Python

Alta performance, voltada para uso de estruturas de dados e análise.

### Tipo básico - DataFrame

* Tipo básico de dados do Pandas é o Dataframe
* Possui formato tabular
* Permite colunas de dados com tipos diferentes de dados
* pode ser criado com base em diferentes tipos de arquivos como CSV ou XLSX.

### Lendo / Escrevendo dados

In [1]:
import pandas as pd
import numpy as np
df = pd.read_csv('pessoas.csv')
print(df)

      nome idade                cidade      estado     país
0  Matheus    23         Guaratinguetá   São Paulo   Brasil
1     José    18             Guarulhos   São Paulo   Brasil
2   Marcos    21   São José dos Campos   São Paulo   Brasil
3    Julia                     Taubaté   São Paulo   Brasil

In [2]:
df.head(2)

      nome idade          cidade      estado     país
0  Matheus    23   Guaratinguetá   São Paulo   Brasil
1     José    18       Guarulhos   São Paulo   Brasil

### Seleção de dados

In [3]:
df.loc[2] #localiza o indice 2

nome                    Marcos
idade                       21
cidade     São José dos Campos
estado               São Paulo
país                    Brasil
Name: 2, dtype: object

In [4]:
df.loc[[3,1]] #localiza os indices 3 e 1

    nome idade      cidade      estado     país
3  Julia           Taubaté   São Paulo   Brasil
1   José    18   Guarulhos   São Paulo   Brasil

In [5]:
df.loc[df['nome'] == 'Matheus']

      nome idade          cidade      estado     país
0  Matheus    23   Guaratinguetá   São Paulo   Brasil

### Operações básicas

In [6]:
dates = pd.date_range('1/1/2000', periods=8)
df = pd.DataFrame(np.random.randn(8,4), index=dates, columns=['A', 'B', 'C', 'D'])
df

                   A         B         C         D
2000-01-01 -1.102209 -0.400117 -0.570612 -1.059288
2000-01-02 -0.603921  0.460393 -0.648860  0.031739
2000-01-03  0.880809  0.303784 -0.116485  0.437841
2000-01-04 -0.555463 -1.963014 -0.531609  0.550216
2000-01-05  2.142939  0.802637  0.660146 -1.204954
2000-01-06 -1.263997  1.594873 -0.115227  1.619568
2000-01-07 -0.247972 -0.971303 -0.326219  0.628603
2000-01-08  1.889637  0.818183  0.666587 -0.531312

Média

In [7]:
df.mean()

A    0.142478
B    0.080680
C   -0.122785
D    0.059052
dtype: float64

Soma

In [8]:
def somaUm(x):
    return x+1
df = df.apply(somaUm) #executa a função para cada um dos valores
df

                   A         B         C         D
2000-01-01 -0.102209  0.599883  0.429388 -0.059288
2000-01-02  0.396079  1.460393  0.351140  1.031739
2000-01-03  1.880809  1.303784  0.883515  1.437841
2000-01-04  0.444537 -0.963014  0.468391  1.550216
2000-01-05  3.142939  1.802637  1.660146 -0.204954
2000-01-06 -0.263997  2.594873  0.884773  2.619568
2000-01-07  0.752028  0.028697  0.673781  1.628603
2000-01-08  2.889637  1.818183  1.666587  0.468688

### Removendo Colunas

In [9]:
df = df.drop(columns=['C', 'D'])
df

                   A         B
2000-01-01 -0.102209  0.599883
2000-01-02  0.396079  1.460393
2000-01-03  1.880809  1.303784
2000-01-04  0.444537 -0.963014
2000-01-05  3.142939  1.802637
2000-01-06 -0.263997  2.594873
2000-01-07  0.752028  0.028697
2000-01-08  2.889637  1.818183

### Localizando por linha e coluna

In [10]:
df.loc['2000-01-01', 'B']

0.5998834078436348

### Removendo Linhas

In [11]:
df2 = pd.read_csv('pessoas.csv',index_col=0) #primeira coluna no arquivo csv para ser usado como índice
df2.drop(['Matheus','Julia'],axis=0)

       idade                cidade      estado     país
nome
José      18             Guarulhos   São Paulo   Brasil
Marcos    21   São José dos Campos   São Paulo   Brasil

### Iterando sobre o dataframe

In [15]:
for i, linha in df2.iterrows():
    print('Index: ', i)
    print('Linha: \n', linha)
    print('-'*70)

Index:  Matheus
Linha:
 idade                 23
cidade     Guaratinguetá
estado         São Paulo
país              Brasil
Name: Matheus, dtype: object
----------------------------------------------------------------------
Index:  José
Linha:
 idade             18
cidade     Guarulhos
estado     São Paulo
país          Brasil
Name: José, dtype: object
----------------------------------------------------------------------
Index:  Marcos
Linha:
 idade                       21
cidade     São José dos Campos
estado               São Paulo
país                    Brasil
Name: Marcos, dtype: object
----------------------------------------------------------------------
Index:  Julia
Linha:
 idade
cidade       Taubaté
estado     São Paulo
país          Brasil
Name: Julia, dtype: object
----------------------------------------------------------------------